In [23]:
import pandas as pd
import numpy as np

In [3]:
s1=pd.Series()
s1

Series([], dtype: object)

In [5]:
s2=pd.Series([1,2,3,4,5])
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
s3=pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [9]:
s4=pd.Series([1,2,3,4,5], index=['a','b','c','d','e'], dtype='f')
s4

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
dtype: float32

In [11]:
li=[11,22,33,44,55]
i=["A","B","C","D","E"]
s5=pd.Series(li,index=i)
s5

A    11
B    22
C    33
D    44
E    55
dtype: int64

In [13]:
t1=(1,2,3,4,5)
s7=pd.Series(t1)
s7

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [15]:
di={"abc":11,"xyz":22,"mnp":33}
s8=pd.Series(di)
s8

abc    11
xyz    22
mnp    33
dtype: int64

In [19]:
s9=pd.Series("Python", index=range(4))
s9

0    Python
1    Python
2    Python
3    Python
dtype: object

In [27]:
s10=pd.Series(np.arange(4))
s10

0    0
1    1
2    2
3    3
dtype: int32

In [29]:
d1=pd.DataFrame()
d1

Empty DataFrame
Columns: []
Index: []

In [31]:
type(d1)

pandas.core.frame.DataFrame

In [35]:
d2=pd.DataFrame([[1,2,3],[4,5,6]])
d2

   0  1  2
0  1  2  3
1  4  5  6

In [37]:
d3=pd.DataFrame([[1,2,3],[4,5,6]], index=["row1","row2"])
d3

      0  1  2
row1  1  2  3
row2  4  5  6

In [39]:
d4=pd.DataFrame([[1,2,3],[4,5,6]], index=["row1","row2"], columns=["col1","col2","col3"])
d4

      col1  col2  col3
row1     1     2     3
row2     4     5     6

In [43]:
d5=pd.DataFrame([[1,2,3],[4,5,6]], index=["row1","row2"], columns=["col1","col2","col3"], dtype='f')
d5

      col1  col2  col3
row1   1.0   2.0   3.0
row2   4.0   5.0   6.0

In [45]:
di={"name":["Bharat","Manish","Rajesh"], "Age":[22,25,24]}
d6=pd.DataFrame(di)
d6

     name  Age
0  Bharat   22
1  Manish   25
2  Rajesh   24

In [47]:
di1={"name":["Bharat","Manish","Rajesh"], "Age":[22,25,24]}
d7=pd.DataFrame(di1)
d7
di2={"name":["Ravi","Aakash","Rajesh"], "Age":[23,27,30]}
d8=pd.DataFrame(di2)
d8

     name  Age
0    Ravi   23
1  Aakash   27
2  Rajesh   30

In [49]:
print(d7)
print(d8)

     name  Age
0  Bharat   22
1  Manish   25
2  Rajesh   24
     name  Age
0    Ravi   23
1  Aakash   27
2  Rajesh   30

In [55]:
d9=pd.concat((d7,d8))
d9

     name  Age
0  Bharat   22
1  Manish   25
2  Rajesh   24
0    Ravi   23
1  Aakash   27
2  Rajesh   30

In [57]:
d10=pd.concat((d7,d8), ignore_index=True)
d10

     name  Age
0  Bharat   22
1  Manish   25
2  Rajesh   24
3    Ravi   23
4  Aakash   27
5  Rajesh   30